apache/nuttx/arch/mips/src/pic32mz/hardware/pic32mz-dma.h
/********************************************************************************************
 * arch/mips/src/pic32mz/hardware/pic32mz-dma.h
 *
 *   Copyright (C) 2015 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ********************************************************************************************/

#ifndef __ARCH_MIPS_SRC_PIC32MZ_HARDWARE_PIC32MZ_DMA_H
#define __ARCH_MIPS_SRC_PIC32MZ_HARDWARE_PIC32MZ_DMA_H

/********************************************************************************************
 * Included Files
 ********************************************************************************************/

#include <nuttx/config.h>
#include <arch/pic32mz/chip.h>

#include "hardware/pic32mz-memorymap.h"

#if CHIP_NDMACH > 0

/********************************************************************************************
 * Pre-processor Definitions
 ********************************************************************************************/
/* DMA Channel Offsets **********************************************************************/

#define PIC32MZ_DMACHn_OFFSET(n)      (0x0060 + 00c0 *(n))
#  define PIC32MZ_DMACH0_OFFSET       0x0060
#  define PIC32MZ_DMACH1_OFFSET       0x0120
#  define PIC32MZ_DMACH2_OFFSET       0x01e0
#  define PIC32MZ_DMACH3_OFFSET       0x02a0
#  define PIC32MZ_DMACH4_OFFSET       0x0360
#  define PIC32MZ_DMACH5_OFFSET       0x0420
#  define PIC32MZ_DMACH6_OFFSET       0x04f0
#  define PIC32MZ_DMACH7_OFFSET       0x05b0

/* DMA Register Offsets *********************************************************************/
/* Global DMA Registers (relative the DMA K1BASE) */

#define PIC32MZ_DMA_CON_OFFSET        0x0000  /* DMA Controller Control Register */
#define PIC32MZ_DMA_CONCLR_OFFSET     0x0004  /* DMA Controller Control Clear Register */
#define PIC32MZ_DMA_CONSET_OFFSET     0x0008  /* DMA Controller Control Set Register */
#define PIC32MZ_DMA_CONINV_OFFSET     0x000c  /* DMA Controller Control Invert Register */

#define PIC32MZ_DMA_STAT_OFFSET       0x0010  /* DMA Status Register */

#define PIC32MZ_DMA_ADDR_OFFSET       0x0020  /* DMA Address Register */

#define PIC32MZ_DMA_CRCCON_OFFSET     0x0030  /* DMA CRC Control Register */
#define PIC32MZ_DMA_CRCCONCLR_OFFSET  0x0034  /* DMA CRC Control Clear Register */
#define PIC32MZ_DMA_CRCCONSET_OFFSET  0x0038  /* DMA CRC Control Set Register */
#define PIC32MZ_DMA_CRCCONINV_OFFSET  0x003c  /* DMA CRC Control Invert Register */

#define PIC32MZ_DMA_CRCDATA_OFFSET    0x0040  /* DMA CRC Data Register */
#define PIC32MZ_DMA_CRCDATACLR_OFFSET 0x0044  /* DMA CRC Data Clear Register */
#define PIC32MZ_DMA_CRCDATASET_OFFSET 0x0048  /* DMA CRC Data Set Register */
#define PIC32MZ_DMA_CRCDATAINV_OFFSET 0x004c  /* DMA CRC Data Invert Register */

#define PIC32MZ_DMA_CRCXOR_OFFSET     0x0050  /* DMA CRCXOR Enable Register */
#define PIC32MZ_DMA_CRCXORCLR_OFFSET  0x0054  /* DMA CRCXOR Enable Clear Register */
#define PIC32MZ_DMA_CRCXORSET_OFFSET  0x0058  /* DMA CRCXOR Enable Set Register */
#define PIC32MZ_DMA_CRCXORINV_OFFSET  0x005c  /* DMA CRCXOR Enable Invert Register */

/* Per-Channel DMA Registers (relative to DMA channel base) */

#define PIC32MZ_DMACH_CON_OFFSET      0x0000  /* DMA Channel Control Register */
#define PIC32MZ_DMACH_CONCLR_OFFSET   0x0004  /* DMA Channel Control Clear Register */
#define PIC32MZ_DMACH_CONSET_OFFSET   0x0008  /* DMA Channel Control Set Register */
#define PIC32MZ_DMACH_CONINV_OFFSET   0x000c  /* DMA Channel Control Invert Register */

#define PIC32MZ_DMACH_ECON_OFFSET     0x0010  /* DMA Channel Event Control Register */
#define PIC32MZ_DMACH_ECONCLR_OFFSET  0x0014  /* DMA Channel Event Control Clear Register */
#define PIC32MZ_DMACH_ECONSET_OFFSET  0x0018  /* DMA Channel Event Control Set Register */
#define PIC32MZ_DMACH_ECONINV_OFFSET  0x001c  /* DMA Channel Event Control Invert Register */

#define PIC32MZ_DMACH_INT_OFFSET      0x0020  /* DMA Channel Interrupt Control Register */
#define PIC32MZ_DMACH_INTCLR_OFFSET   0x0024  /* DMA Channel Interrupt Control Clear Register */
#define PIC32MZ_DMACH_INTSET_OFFSET   0x0028  /* DMA Channel Interrupt Control Set Register */
#define PIC32MZ_DMACH_INTINV_OFFSET   0x002c  /* DMA Channel Interrupt Control Invert Register */

#define PIC32MZ_DMACH_SSA_OFFSET      0x0030  /* DMA Channel Source Start Address Register */
#define PIC32MZ_DMACH_SSACLR_OFFSET   0x0034  /* DMA Channel Source Start Address Clear Register */
#define PIC32MZ_DMACH_SSASET_OFFSET   0x0038  /* DMA Channel Source Start Address Set Register */
#define PIC32MZ_DMACH_SSAINV_OFFSET   0x003c  /* DMA Channel Source Start Address Invert Register */

#define PIC32MZ_DMACH_DSA_OFFSET      0x0040  /* DMA Channel Destination Start Address Register */
#define PIC32MZ_DMACH_DSACLR_OFFSET   0x0044  /* DMA Channel Destination Start Address Clear Register */
#define PIC32MZ_DMACH_DSASET_OFFSET   0x0048  /* DMA Channel Destination Start Address Set Register */
#define PIC32MZ_DMACH_DSAINV_OFFSET   0x004c  /* DMA Channel Destination Start Address Invert Register */

#define PIC32MZ_DMACH_SSIZ_OFFSET     0x0050  /* DMA Channel Source Size Register */
#define PIC32MZ_DMACH_SSIZCLR_OFFSET  0x0054  /* DMA Channel Source Size Clear Register */
#define PIC32MZ_DMACH_SSIZSET_OFFSET  0x0058  /* DMA Channel Source Size Set Register */
#define PIC32MZ_DMACH_SSIZINV_OFFSET  0x005c  /* DMA Channel Source Size Invert Register */

#define PIC32MZ_DMACH_DSIZ_OFFSET     0x0060  /* DMA Channel Destination Size Register */
#define PIC32MZ_DMACH_DSIZCLR_OFFSET  0x0064  /* DMA Channel Destination Size Clear Register */
#define PIC32MZ_DMACH_DSIZSET_OFFSET  0x0068  /* DMA Channel Destination Size Set Register */
#define PIC32MZ_DMACH_DSIZINV_OFFSET  0x006c  /* DMA Channel Destination Size Invert Register */

#define PIC32MZ_DMACH_SPTR_OFFSET     0x0070  /* DMA Channel Source Pointer Register */
#define PIC32MZ_DMACH_DPTR_OFFSET     0x0080  /* DMA Channel Destination Pointer Register */

