apache/nuttx/arch/mips/src/pic32mz/hardware/pic32mz-dma.h
#define PIC32MZ_DMACH_CSIZ_OFFSET     0x0090  /* DMA Channel Cell-Size Register */
#define PIC32MZ_DMACH_CSIZCLR_OFFSET  0x0094  /* DMA Channel Cell-Size Clear Register */
#define PIC32MZ_DMACH_CSIZSET_OFFSET  0x0098  /* DMA Channel Cell-Size Set Register */
#define PIC32MZ_DMACH_CSIZINV_OFFSET  0x009c  /* DMA Channel Cell-Size Invert Register */

#define PIC32MZ_DMACH_CPTR_OFFSET     0x00a0  /* DMA Channel Cell Pointer Register */

#define PIC32MZ_DMACH_DAT_OFFSET      0x00b0  /* DMA Channel Pattern Data Register */
#define PIC32MZ_DMACH_DATCLR_OFFSET   0x00b4  /* DMA Channel Pattern Data Clear Register */
#define PIC32MZ_DMACH_DATSET_OFFSET   0x00b8  /* DMA Channel Pattern Data Set Register */
#define PIC32MZ_DMACH_DATINV_OFFSET   0x00bc  /* DMA Channel Pattern Data Invert Register */

/* DMA Channel Addresses ********************************************************************/

#define PIC32MZ_DMACHn_K1BASE(n)      (PIC32MZ_DMA_K1BASE+PIC32MZ_DMACHn_OFFSET(n))
#  define PIC32MZ_DMACH0_K1BASE       (PIC32MZ_DMA_K1BASE+PIC32MZ_DMACH0_OFFSET)
#  define PIC32MZ_DMACH1_K1BASE       (PIC32MZ_DMA_K1BASE+PIC32MZ_DMACH1_OFFSET)
#  define PIC32MZ_DMACH2_K1BASE       (PIC32MZ_DMA_K1BASE+PIC32MZ_DMACH2_OFFSET)
#  define PIC32MZ_DMACH3_K1BASE       (PIC32MZ_DMA_K1BASE+PIC32MZ_DMACH3_OFFSET)
#  define PIC32MZ_DMACH4_K1BASE       (PIC32MZ_DMA_K1BASE+PIC32MZ_DMACH4_OFFSET)
#  define PIC32MZ_DMACH5_K1BASE       (PIC32MZ_DMA_K1BASE+PIC32MZ_DMACH5_OFFSET)
#  define PIC32MZ_DMACH6_K1BASE       (PIC32MZ_DMA_K1BASE+PIC32MZ_DMACH6_OFFSET)
#  define PIC32MZ_DMACH7_K1BASE       (PIC32MZ_DMA_K1BASE+PIC32MZ_DMACH7_OFFSET)

/* DMA Register Addresses *******************************************************************/
/* Global DMA Registers */

#define PIC32MZ_DMA_CON               (PIC32MZ_DMA_K1BASE+PIC32MZ_DMA_CON_OFFSET)
#define PIC32MZ_DMA_CONCLR            (PIC32MZ_DMA_K1BASE+PIC32MZ_DMA_CONCLR_OFFSET)
#define PIC32MZ_DMA_CONSET            (PIC32MZ_DMA_K1BASE+PIC32MZ_DMA_CONSET_OFFSET)
#define PIC32MZ_DMA_CONINV            (PIC32MZ_DMA_K1BASE+PIC32MZ_DMA_CONINV_OFFSET)

#define PIC32MZ_DMA_STAT              (PIC32MZ_DMA_K1BASE+PIC32MZ_DMA_STAT_OFFSET)

#define PIC32MZ_DMA_ADDR              (PIC32MZ_DMA_K1BASE+PIC32MZ_DMA_ADDR_OFFSET)
#define PIC32MZ_DMA_CRCCON            (PIC32MZ_DMA_K1BASE+PIC32MZ_DMA_CRCCON_OFFSET)
#define PIC32MZ_DMA_CRCCONCLR         (PIC32MZ_DMA_K1BASE+PIC32MZ_DMA_CRCCONCLR_OFFSET)
#define PIC32MZ_DMA_CRCCONSET         (PIC32MZ_DMA_K1BASE+PIC32MZ_DMA_CRCCONSET_OFFSET)
#define PIC32MZ_DMA_CRCCONINV         (PIC32MZ_DMA_K1BASE+PIC32MZ_DMA_CRCCONINV_OFFSET)

#define PIC32MZ_DMA_CRCDATA           (PIC32MZ_DMA_K1BASE+PIC32MZ_DMA_CRCDATA_OFFSET)
#define PIC32MZ_DMA_CRCDATACLR        (PIC32MZ_DMA_K1BASE+PIC32MZ_DMA_CRCDATACLR_OFFSET)
#define PIC32MZ_DMA_CRCDATASET        (PIC32MZ_DMA_K1BASE+PIC32MZ_DMA_CRCDATASET_OFFSET)
#define PIC32MZ_DMA_CRCDATAINV        (PIC32MZ_DMA_K1BASE+PIC32MZ_DMA_CRCDATAINV_OFFSET)

#define PIC32MZ_DMA_CRCXOR            (PIC32MZ_DMA_K1BASE+PIC32MZ_DMA_CRCXOR_OFFSET)
#define PIC32MZ_DMA_CRCXORCLR         (PIC32MZ_DMA_K1BASE+PIC32MZ_DMA_CRCXORCLR_OFFSET)
#define PIC32MZ_DMA_CRCXORSET         (PIC32MZ_DMA_K1BASE+PIC32MZ_DMA_CRCXORSET_OFFSET)
#define PIC32MZ_DMA_CRCXORINV         (PIC32MZ_DMA_K1BASE+PIC32MZ_DMA_CRCXORINV_OFFSET)

/* Per-Channel DMA Registers */

#define PIC32MZ_DMACH_CON(n)          (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_CON_OFFSET)
#define PIC32MZ_DMACH_CONCLR(n)       (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_CONCLR_OFFSET)
#define PIC32MZ_DMACH_CONSET(n)       (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_CONSET_OFFSET)
#define PIC32MZ_DMACH_CONINV(n)       (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_CONINV_OFFSET)

#define PIC32MZ_DMACH_ECON(n)         (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_ECON_OFFSET)
#define PIC32MZ_DMACH_ECONCLR(n)      (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_ECONCLR_OFFSET)
#define PIC32MZ_DMACH_ECONSET(n)      (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_ECONSET_OFFSET)
#define PIC32MZ_DMACH_ECONINV(n)      (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_ECONINV_OFFSET)

#define PIC32MZ_DMACH_INT(n)          (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_INT_OFFSET)
#define PIC32MZ_DMACH_INTCLR(n)       (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_INTCLR_OFFSET)
#define PIC32MZ_DMACH_INTSET(n)       (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_INTSET_OFFSET)
#define PIC32MZ_DMACH_INTINV(n)       (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_INTINV_OFFSET)

#define PIC32MZ_DMACH_SSA(n)          (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_SSA_OFFSET)
#define PIC32MZ_DMACH_SSACLR(n)       (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_SSACLR_OFFSET)
#define PIC32MZ_DMACH_SSASET(n)       (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_SSASET_OFFSET)
#define PIC32MZ_DMACH_SSAINV(n)       (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_SSAINV_OFFSET)

#define PIC32MZ_DMACH_DSA(n)          (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_DSA_OFFSET)
#define PIC32MZ_DMACH_DSACLR(n)       (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_DSACLR_OFFSET)
#define PIC32MZ_DMACH_DSASET(n)       (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_DSASET_OFFSET)
#define PIC32MZ_DMACH_DSAINV(n)       (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_DSAINV_OFFSET)

#define PIC32MZ_DMACH_SSIZ(n)         (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_SSIZ_OFFSET)
#define PIC32MZ_DMACH_SSIZCLR(n)      (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_SSIZCLR_OFFSET)
#define PIC32MZ_DMACH_SSIZSET(n)      (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_SSIZSET_OFFSET)
#define PIC32MZ_DMACH_SSIZINV(n)      (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_SSIZINV_OFFSET)

#define PIC32MZ_DMACH_DSIZ(n)         (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_DSIZ_OFFSET)
#define PIC32MZ_DMACH_DSIZCLR(n)      (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_DSIZCLR_OFFSET)
#define PIC32MZ_DMACH_DSIZSET(n)      (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_DSIZSET_OFFSET)
#define PIC32MZ_DMACH_DSIZINV(n)      (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_DSIZINV_OFFSET)

#define PIC32MZ_DMACH_SPTR(n)         (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_SPTR_OFFSET)

#define PIC32MZ_DMACH_DPTR(n)         (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_DPTR_OFFSET)

#define PIC32MZ_DMACH_CSIZ(n)         (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_CSIZ_OFFSET)
#define PIC32MZ_DMACH_CSIZCLR(n)      (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_CSIZCLR_OFFSET)
#define PIC32MZ_DMACH_CSIZSET(n)      (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_CSIZSET_OFFSET)
#define PIC32MZ_DMACH_CSIZINV(n)      (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_CSIZINV_OFFSET)

#define PIC32MZ_DMACH_CPTR(n)         (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_CPTR_OFFSET)

#define PIC32MZ_DMACH_DAT(n)          (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_DAT_OFFSET)
#define PIC32MZ_DMACH_DATCLR(n)       (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_DATCLR_OFFSET)
#define PIC32MZ_DMACH_DATSET(n)       (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_DATSET_OFFSET)
#define PIC32MZ_DMACH_DATINV(n)       (PIC32MZ_DMACHn_K1BASE(n)+PIC32MZ_DMACH_DATINV_OFFSET)

#if CHIP_NDMACH > 0
#  define PIC32MZ_DMACH0_CON          (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_CON_OFFSET)
#  define PIC32MZ_DMACH0_CONCLR       (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_CONCLR_OFFSET)
#  define PIC32MZ_DMACH0_CONSET       (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_CONSET_OFFSET)
#  define PIC32MZ_DMACH0_CONINV       (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_CONINV_OFFSET)

