apache/nuttx/arch/mips/src/pic32mz/hardware/pic32mz-dma.h
#  define PIC32MZ_DMACH0_ECON         (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_ECON_OFFSET)
#  define PIC32MZ_DMACH0_ECONCLR      (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_ECONCLR_OFFSET)
#  define PIC32MZ_DMACH0_ECONSET      (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_ECONSET_OFFSET)
#  define PIC32MZ_DMACH0_ECONINV      (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_ECONINV_OFFSET)

#  define PIC32MZ_DMACH0_INT          (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_INT_OFFSET)
#  define PIC32MZ_DMACH0_INTCLR       (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_INTCLR_OFFSET)
#  define PIC32MZ_DMACH0_INTSET       (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_INTSET_OFFSET)
#  define PIC32MZ_DMACH0_INTINV       (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_INTINV_OFFSET)

#  define PIC32MZ_DMACH0_SSA          (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_SSA_OFFSET)
#  define PIC32MZ_DMACH0_SSACLR       (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_SSACLR_OFFSET)
#  define PIC32MZ_DMACH0_SSASET       (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_SSASET_OFFSET)
#  define PIC32MZ_DMACH0_SSAINV       (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_SSAINV_OFFSET)

#  define PIC32MZ_DMACH0_DSA          (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_DSA_OFFSET)
#  define PIC32MZ_DMACH0_DSACLR       (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_DSACLR_OFFSET)
#  define PIC32MZ_DMACH0_DSASET       (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_DSASET_OFFSET)
#  define PIC32MZ_DMACH0_DSAINV       (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_DSAINV_OFFSET)

#  define PIC32MZ_DMACH0_SSIZ         (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_SSIZ_OFFSET)
#  define PIC32MZ_DMACH0_SSIZCLR      (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_SSIZCLR_OFFSET)
#  define PIC32MZ_DMACH0_SSIZSET      (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_SSIZSET_OFFSET)
#  define PIC32MZ_DMACH0_SSIZINV      (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_SSIZINV_OFFSET)

#  define PIC32MZ_DMACH0_DSIZ         (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_DSIZ_OFFSET)
#  define PIC32MZ_DMACH0_DSIZCLR      (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_DSIZCLR_OFFSET)
#  define PIC32MZ_DMACH0_DSIZSET      (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_DSIZSET_OFFSET)
#  define PIC32MZ_DMACH0_DSIZINV      (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_DSIZINV_OFFSET)

#  define PIC32MZ_DMACH0_SPTR         (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_SPTR_OFFSET)
#  define PIC32MZ_DMACH0_DPTR         (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_DPTR_OFFSET)

#  define PIC32MZ_DMACH0_CSIZ         (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_CSIZ_OFFSET)
#  define PIC32MZ_DMACH0_CSIZCLR      (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_CSIZCLR_OFFSET)
#  define PIC32MZ_DMACH0_CSIZSET      (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_CSIZSET_OFFSET)
#  define PIC32MZ_DMACH0_CSIZINV      (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_CSIZINV_OFFSET)

#  define PIC32MZ_DMACH0_CPTR         (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_CPTR_OFFSET)

#  define PIC32MZ_DMACH0_DAT          (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_DAT_OFFSET)
#  define PIC32MZ_DMACH0_DATCLR       (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_DATCLR_OFFSET)
#  define PIC32MZ_DMACH0_DATSET       (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_DATSET_OFFSET)
#  define PIC32MZ_DMACH0_DATINV       (PIC32MZ_DMACH0_K1BASE+PIC32MZ_DMACH_DATINV_OFFSET)
#endif

#if CHIP_NDMACH > 1
#  define PIC32MZ_DMACH1_CON          (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_CON_OFFSET)
#  define PIC32MZ_DMACH1_CONCLR       (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_CONCLR_OFFSET)
#  define PIC32MZ_DMACH1_CONSET       (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_CONSET_OFFSET)
#  define PIC32MZ_DMACH1_CONINV       (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_CONINV_OFFSET)

#  define PIC32MZ_DMACH1_ECON         (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_ECON_OFFSET)
#  define PIC32MZ_DMACH1_ECONCLR      (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_ECONCLR_OFFSET)
#  define PIC32MZ_DMACH1_ECONSET      (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_ECONSET_OFFSET)
#  define PIC32MZ_DMACH1_ECONINV      (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_ECONINV_OFFSET)

#  define PIC32MZ_DMACH1_INT          (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_INT_OFFSET)
#  define PIC32MZ_DMACH1_INTCLR       (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_INTCLR_OFFSET)
#  define PIC32MZ_DMACH1_INTSET       (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_INTSET_OFFSET)
#  define PIC32MZ_DMACH1_INTINV       (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_INTINV_OFFSET)

#  define PIC32MZ_DMACH1_SSA          (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_SSA_OFFSET)
#  define PIC32MZ_DMACH1_SSACLR       (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_SSACLR_OFFSET)
#  define PIC32MZ_DMACH1_SSASET       (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_SSASET_OFFSET)
#  define PIC32MZ_DMACH1_SSAINV       (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_SSAINV_OFFSET)

#  define PIC32MZ_DMACH1_DSA          (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_DSA_OFFSET)
#  define PIC32MZ_DMACH1_DSACLR       (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_DSACLR_OFFSET)
#  define PIC32MZ_DMACH1_DSASET       (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_DSASET_OFFSET)
#  define PIC32MZ_DMACH1_DSAINV       (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_DSAINV_OFFSET)

#  define PIC32MZ_DMACH1_SSIZ         (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_SSIZ_OFFSET)
#  define PIC32MZ_DMACH1_SSIZCLR      (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_SSIZCLR_OFFSET)
#  define PIC32MZ_DMACH1_SSIZSET      (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_SSIZSET_OFFSET)
#  define PIC32MZ_DMACH1_SSIZINV      (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_SSIZINV_OFFSET)

#  define PIC32MZ_DMACH1_DSIZ         (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_DSIZ_OFFSET)
#  define PIC32MZ_DMACH1_DSIZCLR      (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_DSIZCLR_OFFSET)
#  define PIC32MZ_DMACH1_DSIZSET      (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_DSIZSET_OFFSET)
#  define PIC32MZ_DMACH1_DSIZINV      (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_DSIZINV_OFFSET)

#  define PIC32MZ_DMACH1_SPTR         (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_SPTR_OFFSET)
#  define PIC32MZ_DMACH1_DPTR         (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_DPTR_OFFSET)

#  define PIC32MZ_DMACH1_CSIZ         (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_CSIZ_OFFSET)
#  define PIC32MZ_DMACH1_CSIZCLR      (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_CSIZCLR_OFFSET)
#  define PIC32MZ_DMACH1_CSIZSET      (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_CSIZSET_OFFSET)
#  define PIC32MZ_DMACH1_CSIZINV      (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_CSIZINV_OFFSET)

#  define PIC32MZ_DMACH1_CPTR         (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_CPTR_OFFSET)

#  define PIC32MZ_DMACH1_DAT          (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_DAT_OFFSET)
#  define PIC32MZ_DMACH1_DATCLR       (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_DATCLR_OFFSET)
#  define PIC32MZ_DMACH1_DATSET       (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_DATSET_OFFSET)
#  define PIC32MZ_DMACH1_DATINV       (PIC32MZ_DMACH1_K1BASE+PIC32MZ_DMACH_DATINV_OFFSET)
#endif

#if CHIP_NDMACH > 2
#  define PIC32MZ_DMACH2_CON          (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_CON_OFFSET)
#  define PIC32MZ_DMACH2_CONCLR       (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_CONCLR_OFFSET)
#  define PIC32MZ_DMACH2_CONSET       (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_CONSET_OFFSET)
#  define PIC32MZ_DMACH2_CONINV       (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_CONINV_OFFSET)

#  define PIC32MZ_DMACH2_ECON         (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_ECON_OFFSET)
#  define PIC32MZ_DMACH2_ECONCLR      (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_ECONCLR_OFFSET)
#  define PIC32MZ_DMACH2_ECONSET      (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_ECONSET_OFFSET)
#  define PIC32MZ_DMACH2_ECONINV      (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_ECONINV_OFFSET)

#  define PIC32MZ_DMACH2_INT          (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_INT_OFFSET)
#  define PIC32MZ_DMACH2_INTCLR       (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_INTCLR_OFFSET)
#  define PIC32MZ_DMACH2_INTSET       (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_INTSET_OFFSET)
#  define PIC32MZ_DMACH2_INTINV       (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_INTINV_OFFSET)

#  define PIC32MZ_DMACH2_SSA          (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_SSA_OFFSET)
#  define PIC32MZ_DMACH2_SSACLR       (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_SSACLR_OFFSET)
#  define PIC32MZ_DMACH2_SSASET       (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_SSASET_OFFSET)
#  define PIC32MZ_DMACH2_SSAINV       (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_SSAINV_OFFSET)

#  define PIC32MZ_DMACH2_DSA          (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_DSA_OFFSET)
#  define PIC32MZ_DMACH2_DSACLR       (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_DSACLR_OFFSET)
#  define PIC32MZ_DMACH2_DSASET       (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_DSASET_OFFSET)
#  define PIC32MZ_DMACH2_DSAINV       (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_DSAINV_OFFSET)

#  define PIC32MZ_DMACH2_SSIZ         (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_SSIZ_OFFSET)
#  define PIC32MZ_DMACH2_SSIZCLR      (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_SSIZCLR_OFFSET)
#  define PIC32MZ_DMACH2_SSIZSET      (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_SSIZSET_OFFSET)
#  define PIC32MZ_DMACH2_SSIZINV      (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_SSIZINV_OFFSET)

#  define PIC32MZ_DMACH2_DSIZ         (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_DSIZ_OFFSET)
#  define PIC32MZ_DMACH2_DSIZCLR      (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_DSIZCLR_OFFSET)
#  define PIC32MZ_DMACH2_DSIZSET      (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_DSIZSET_OFFSET)
#  define PIC32MZ_DMACH2_DSIZINV      (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_DSIZINV_OFFSET)

#  define PIC32MZ_DMACH2_SPTR         (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_SPTR_OFFSET)
#  define PIC32MZ_DMACH2_DPTR         (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_DPTR_OFFSET)

