apache/nuttx/arch/mips/src/pic32mz/hardware/pic32mz-dma.h
#  define PIC32MZ_DMACH2_CSIZ         (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_CSIZ_OFFSET)
#  define PIC32MZ_DMACH2_CSIZCLR      (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_CSIZCLR_OFFSET)
#  define PIC32MZ_DMACH2_CSIZSET      (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_CSIZSET_OFFSET)
#  define PIC32MZ_DMACH2_CSIZINV      (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_CSIZINV_OFFSET)

#  define PIC32MZ_DMACH2_CPTR         (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_CPTR_OFFSET)

#  define PIC32MZ_DMACH2_DAT          (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_DAT_OFFSET)
#  define PIC32MZ_DMACH2_DATCLR       (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_DATCLR_OFFSET)
#  define PIC32MZ_DMACH2_DATSET       (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_DATSET_OFFSET)
#  define PIC32MZ_DMACH2_DATINV       (PIC32MZ_DMACH2_K1BASE+PIC32MZ_DMACH_DATINV_OFFSET)

#if CHIP_NDMACH > 3
#  define PIC32MZ_DMACH3_CON          (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_CON_OFFSET)
#  define PIC32MZ_DMACH3_CONCLR       (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_CONCLR_OFFSET)
#  define PIC32MZ_DMACH3_CONSET       (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_CONSET_OFFSET)
#  define PIC32MZ_DMACH3_CONINV       (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_CONINV_OFFSET)

#  define PIC32MZ_DMACH3_ECON         (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_ECON_OFFSET)
#  define PIC32MZ_DMACH3_ECONCLR      (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_ECONCLR_OFFSET)
#  define PIC32MZ_DMACH3_ECONSET      (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_ECONSET_OFFSET)
#  define PIC32MZ_DMACH3_ECONINV      (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_ECONINV_OFFSET)

#  define PIC32MZ_DMACH3_INT          (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_INT_OFFSET)
#  define PIC32MZ_DMACH3_INTCLR       (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_INTCLR_OFFSET)
#  define PIC32MZ_DMACH3_INTSET       (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_INTSET_OFFSET)
#  define PIC32MZ_DMACH3_INTINV       (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_INTINV_OFFSET)

#  define PIC32MZ_DMACH3_SSA          (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_SSA_OFFSET)
#  define PIC32MZ_DMACH3_SSACLR       (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_SSACLR_OFFSET)
#  define PIC32MZ_DMACH3_SSASET       (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_SSASET_OFFSET)
#  define PIC32MZ_DMACH3_SSAINV       (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_SSAINV_OFFSET)

#  define PIC32MZ_DMACH3_DSA          (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_DSA_OFFSET)
#  define PIC32MZ_DMACH3_DSACLR       (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_DSACLR_OFFSET)
#  define PIC32MZ_DMACH3_DSASET       (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_DSASET_OFFSET)
#  define PIC32MZ_DMACH3_DSAINV       (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_DSAINV_OFFSET)

#  define PIC32MZ_DMACH3_SSIZ         (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_SSIZ_OFFSET)
#  define PIC32MZ_DMACH3_SSIZCLR      (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_SSIZCLR_OFFSET)
#  define PIC32MZ_DMACH3_SSIZSET      (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_SSIZSET_OFFSET)
#  define PIC32MZ_DMACH3_SSIZINV      (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_SSIZINV_OFFSET)

#  define PIC32MZ_DMACH3_DSIZ         (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_DSIZ_OFFSET)
#  define PIC32MZ_DMACH3_DSIZCLR      (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_DSIZCLR_OFFSET)
#  define PIC32MZ_DMACH3_DSIZSET      (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_DSIZSET_OFFSET)
#  define PIC32MZ_DMACH3_DSIZINV      (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_DSIZINV_OFFSET)

#  define PIC32MZ_DMACH3_SPTR         (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_SPTR_OFFSET)
#  define PIC32MZ_DMACH3_DPTR         (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_DPTR_OFFSET)

#  define PIC32MZ_DMACH3_CSIZ         (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_CSIZ_OFFSET)
#  define PIC32MZ_DMACH3_CSIZCLR      (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_CSIZCLR_OFFSET)
#  define PIC32MZ_DMACH3_CSIZSET      (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_CSIZSET_OFFSET)
#  define PIC32MZ_DMACH3_CSIZINV      (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_CSIZINV_OFFSET)

#  define PIC32MZ_DMACH3_CPTR         (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_CPTR_OFFSET)

#  define PIC32MZ_DMACH3_DAT          (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_DAT_OFFSET)
#  define PIC32MZ_DMACH3_DATCLR       (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_DATCLR_OFFSET)
#  define PIC32MZ_DMACH3_DATSET       (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_DATSET_OFFSET)
#  define PIC32MZ_DMACH3_DATINV       (PIC32MZ_DMACH3_K1BASE+PIC32MZ_DMACH_DATINV_OFFSET)
#endif

#if CHIP_NDMACH > 4
#  define PIC32MZ_DMACH4_CON          (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_CON_OFFSET)
#  define PIC32MZ_DMACH4_CONCLR       (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_CONCLR_OFFSET)
#  define PIC32MZ_DMACH4_CONSET       (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_CONSET_OFFSET)
#  define PIC32MZ_DMACH4_CONINV       (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_CONINV_OFFSET)

#  define PIC32MZ_DMACH4_ECON         (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_ECON_OFFSET)
#  define PIC32MZ_DMACH4_ECONCLR      (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_ECONCLR_OFFSET)
#  define PIC32MZ_DMACH4_ECONSET      (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_ECONSET_OFFSET)
#  define PIC32MZ_DMACH4_ECONINV      (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_ECONINV_OFFSET)

#  define PIC32MZ_DMACH4_INT          (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_INT_OFFSET)
#  define PIC32MZ_DMACH4_INTCLR       (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_INTCLR_OFFSET)
#  define PIC32MZ_DMACH4_INTSET       (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_INTSET_OFFSET)
#  define PIC32MZ_DMACH4_INTINV       (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_INTINV_OFFSET)

#  define PIC32MZ_DMACH4_SSA          (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_SSA_OFFSET)
#  define PIC32MZ_DMACH4_SSACLR       (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_SSACLR_OFFSET)
#  define PIC32MZ_DMACH4_SSASET       (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_SSASET_OFFSET)
#  define PIC32MZ_DMACH4_SSAINV       (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_SSAINV_OFFSET)

#  define PIC32MZ_DMACH4_DSA          (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_DSA_OFFSET)
#  define PIC32MZ_DMACH4_DSACLR       (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_DSACLR_OFFSET)
#  define PIC32MZ_DMACH4_DSASET       (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_DSASET_OFFSET)
#  define PIC32MZ_DMACH4_DSAINV       (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_DSAINV_OFFSET)

