apache/nuttx/arch/mips/src/pic32mz/hardware/pic32mz-dma.h
#  define PIC32MZ_DMACH4_SSIZ         (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_SSIZ_OFFSET)
#  define PIC32MZ_DMACH4_SSIZCLR      (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_SSIZCLR_OFFSET)
#  define PIC32MZ_DMACH4_SSIZSET      (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_SSIZSET_OFFSET)
#  define PIC32MZ_DMACH4_SSIZINV      (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_SSIZINV_OFFSET)

#  define PIC32MZ_DMACH4_DSIZ         (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_DSIZ_OFFSET)
#  define PIC32MZ_DMACH4_DSIZCLR      (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_DSIZCLR_OFFSET)
#  define PIC32MZ_DMACH4_DSIZSET      (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_DSIZSET_OFFSET)
#  define PIC32MZ_DMACH4_DSIZINV      (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_DSIZINV_OFFSET)

#  define PIC32MZ_DMACH4_SPTR         (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_SPTR_OFFSET)
#  define PIC32MZ_DMACH4_DPTR         (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_DPTR_OFFSET)

#  define PIC32MZ_DMACH4_CSIZ         (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_CSIZ_OFFSET)
#  define PIC32MZ_DMACH4_CSIZCLR      (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_CSIZCLR_OFFSET)
#  define PIC32MZ_DMACH4_CSIZSET      (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_CSIZSET_OFFSET)
#  define PIC32MZ_DMACH4_CSIZINV      (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_CSIZINV_OFFSET)

#  define PIC32MZ_DMACH4_CPTR         (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_CPTR_OFFSET)

#  define PIC32MZ_DMACH4_DAT          (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_DAT_OFFSET)
#  define PIC32MZ_DMACH4_DATCLR       (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_DATCLR_OFFSET)
#  define PIC32MZ_DMACH4_DATSET       (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_DATSET_OFFSET)
#  define PIC32MZ_DMACH4_DATINV       (PIC32MZ_DMACH4_K1BASE+PIC32MZ_DMACH_DATINV_OFFSET)
#endif

#if CHIP_NDMACH > 5
#  define PIC32MZ_DMACH5_CON          (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_CON_OFFSET)
#  define PIC32MZ_DMACH5_CONCLR       (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_CONCLR_OFFSET)
#  define PIC32MZ_DMACH5_CONSET       (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_CONSET_OFFSET)
#  define PIC32MZ_DMACH5_CONINV       (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_CONINV_OFFSET)

#  define PIC32MZ_DMACH5_ECON         (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_ECON_OFFSET)
#  define PIC32MZ_DMACH5_ECONCLR      (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_ECONCLR_OFFSET)
#  define PIC32MZ_DMACH5_ECONSET      (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_ECONSET_OFFSET)
#  define PIC32MZ_DMACH5_ECONINV      (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_ECONINV_OFFSET)

#  define PIC32MZ_DMACH5_INT          (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_INT_OFFSET)
#  define PIC32MZ_DMACH5_INTCLR       (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_INTCLR_OFFSET)
#  define PIC32MZ_DMACH5_INTSET       (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_INTSET_OFFSET)
#  define PIC32MZ_DMACH5_INTINV       (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_INTINV_OFFSET)

#  define PIC32MZ_DMACH5_SSA          (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_SSA_OFFSET)
#  define PIC32MZ_DMACH5_SSACLR       (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_SSACLR_OFFSET)
#  define PIC32MZ_DMACH5_SSASET       (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_SSASET_OFFSET)
#  define PIC32MZ_DMACH5_SSAINV       (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_SSAINV_OFFSET)

#  define PIC32MZ_DMACH5_DSA          (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_DSA_OFFSET)
#  define PIC32MZ_DMACH5_DSACLR       (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_DSACLR_OFFSET)
#  define PIC32MZ_DMACH5_DSASET       (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_DSASET_OFFSET)
#  define PIC32MZ_DMACH5_DSAINV       (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_DSAINV_OFFSET)

#  define PIC32MZ_DMACH5_SSIZ         (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_SSIZ_OFFSET)
#  define PIC32MZ_DMACH5_SSIZCLR      (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_SSIZCLR_OFFSET)
#  define PIC32MZ_DMACH5_SSIZSET      (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_SSIZSET_OFFSET)
#  define PIC32MZ_DMACH5_SSIZINV      (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_SSIZINV_OFFSET)

#  define PIC32MZ_DMACH5_DSIZ         (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_DSIZ_OFFSET)
#  define PIC32MZ_DMACH5_DSIZCLR      (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_DSIZCLR_OFFSET)
#  define PIC32MZ_DMACH5_DSIZSET      (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_DSIZSET_OFFSET)
#  define PIC32MZ_DMACH5_DSIZINV      (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_DSIZINV_OFFSET)

#  define PIC32MZ_DMACH5_SPTR         (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_SPTR_OFFSET)
#  define PIC32MZ_DMACH5_DPTR         (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_DPTR_OFFSET)

#  define PIC32MZ_DMACH5_CSIZ         (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_CSIZ_OFFSET)
#  define PIC32MZ_DMACH5_CSIZCLR      (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_CSIZCLR_OFFSET)
#  define PIC32MZ_DMACH5_CSIZSET      (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_CSIZSET_OFFSET)
#  define PIC32MZ_DMACH5_CSIZINV      (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_CSIZINV_OFFSET)

#  define PIC32MZ_DMACH5_CPTR         (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_CPTR_OFFSET)

#  define PIC32MZ_DMACH5_DAT          (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_DAT_OFFSET)
#  define PIC32MZ_DMACH5_DATCLR       (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_DATCLR_OFFSET)
#  define PIC32MZ_DMACH5_DATSET       (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_DATSET_OFFSET)
#  define PIC32MZ_DMACH5_DATINV       (PIC32MZ_DMACH5_K1BASE+PIC32MZ_DMACH_DATINV_OFFSET)
#endif

#if CHIP_NDMACH > 6
#  define PIC32MZ_DMACH6_CON          (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_CON_OFFSET)
#  define PIC32MZ_DMACH6_CONCLR       (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_CONCLR_OFFSET)
#  define PIC32MZ_DMACH6_CONSET       (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_CONSET_OFFSET)
#  define PIC32MZ_DMACH6_CONINV       (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_CONINV_OFFSET)

#  define PIC32MZ_DMACH6_ECON         (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_ECON_OFFSET)
#  define PIC32MZ_DMACH6_ECONCLR      (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_ECONCLR_OFFSET)
#  define PIC32MZ_DMACH6_ECONSET      (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_ECONSET_OFFSET)
#  define PIC32MZ_DMACH6_ECONINV      (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_ECONINV_OFFSET)

#  define PIC32MZ_DMACH6_INT          (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_INT_OFFSET)
#  define PIC32MZ_DMACH6_INTCLR       (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_INTCLR_OFFSET)
#  define PIC32MZ_DMACH6_INTSET       (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_INTSET_OFFSET)
#  define PIC32MZ_DMACH6_INTINV       (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_INTINV_OFFSET)

#  define PIC32MZ_DMACH6_SSA          (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_SSA_OFFSET)
#  define PIC32MZ_DMACH6_SSACLR       (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_SSACLR_OFFSET)
#  define PIC32MZ_DMACH6_SSASET       (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_SSASET_OFFSET)
#  define PIC32MZ_DMACH6_SSAINV       (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_SSAINV_OFFSET)

#  define PIC32MZ_DMACH6_DSA          (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_DSA_OFFSET)
#  define PIC32MZ_DMACH6_DSACLR       (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_DSACLR_OFFSET)
#  define PIC32MZ_DMACH6_DSASET       (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_DSASET_OFFSET)
#  define PIC32MZ_DMACH6_DSAINV       (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_DSAINV_OFFSET)

#  define PIC32MZ_DMACH6_SSIZ         (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_SSIZ_OFFSET)
#  define PIC32MZ_DMACH6_SSIZCLR      (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_SSIZCLR_OFFSET)
#  define PIC32MZ_DMACH6_SSIZSET      (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_SSIZSET_OFFSET)
#  define PIC32MZ_DMACH6_SSIZINV      (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_SSIZINV_OFFSET)

