apache/nuttx/arch/mips/src/pic32mz/hardware/pic32mz-dma.h
#  define PIC32MZ_DMACH6_DSIZ         (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_DSIZ_OFFSET)
#  define PIC32MZ_DMACH6_DSIZCLR      (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_DSIZCLR_OFFSET)
#  define PIC32MZ_DMACH6_DSIZSET      (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_DSIZSET_OFFSET)
#  define PIC32MZ_DMACH6_DSIZINV      (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_DSIZINV_OFFSET)

#  define PIC32MZ_DMACH6_SPTR         (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_SPTR_OFFSET)
#  define PIC32MZ_DMACH6_DPTR         (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_DPTR_OFFSET)

#  define PIC32MZ_DMACH6_CSIZ         (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_CSIZ_OFFSET)
#  define PIC32MZ_DMACH6_CSIZCLR      (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_CSIZCLR_OFFSET)
#  define PIC32MZ_DMACH6_CSIZSET      (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_CSIZSET_OFFSET)
#  define PIC32MZ_DMACH6_CSIZINV      (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_CSIZINV_OFFSET)

#  define PIC32MZ_DMACH6_CPTR         (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_CPTR_OFFSET)

#  define PIC32MZ_DMACH6_DAT          (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_DAT_OFFSET)
#  define PIC32MZ_DMACH6_DATCLR       (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_DATCLR_OFFSET)
#  define PIC32MZ_DMACH6_DATSET       (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_DATSET_OFFSET)
#  define PIC32MZ_DMACH6_DATINV       (PIC32MZ_DMACH6_K1BASE+PIC32MZ_DMACH_DATINV_OFFSET)
#endif

#if CHIP_NDMACH > 7
#  define PIC32MZ_DMACH7_CON          (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_CON_OFFSET)
#  define PIC32MZ_DMACH7_CONCLR       (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_CONCLR_OFFSET)
#  define PIC32MZ_DMACH7_CONSET       (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_CONSET_OFFSET)
#  define PIC32MZ_DMACH7_CONINV       (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_CONINV_OFFSET)

#  define PIC32MZ_DMACH7_ECON         (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_ECON_OFFSET)
#  define PIC32MZ_DMACH7_ECONCLR      (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_ECONCLR_OFFSET)
#  define PIC32MZ_DMACH7_ECONSET      (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_ECONSET_OFFSET)
#  define PIC32MZ_DMACH7_ECONINV      (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_ECONINV_OFFSET)

#  define PIC32MZ_DMACH7_INT          (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_INT_OFFSET)
#  define PIC32MZ_DMACH7_INTCLR       (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_INTCLR_OFFSET)
#  define PIC32MZ_DMACH7_INTSET       (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_INTSET_OFFSET)
#  define PIC32MZ_DMACH7_INTINV       (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_INTINV_OFFSET)

#  define PIC32MZ_DMACH7_SSA          (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_SSA_OFFSET)
#  define PIC32MZ_DMACH7_SSACLR       (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_SSACLR_OFFSET)
#  define PIC32MZ_DMACH7_SSASET       (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_SSASET_OFFSET)
#  define PIC32MZ_DMACH7_SSAINV       (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_SSAINV_OFFSET)

#  define PIC32MZ_DMACH7_DSA          (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_DSA_OFFSET)
#  define PIC32MZ_DMACH7_DSACLR       (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_DSACLR_OFFSET)
#  define PIC32MZ_DMACH7_DSASET       (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_DSASET_OFFSET)
#  define PIC32MZ_DMACH7_DSAINV       (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_DSAINV_OFFSET)

#  define PIC32MZ_DMACH7_SSIZ         (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_SSIZ_OFFSET)
#  define PIC32MZ_DMACH7_SSIZCLR      (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_SSIZCLR_OFFSET)
#  define PIC32MZ_DMACH7_SSIZSET      (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_SSIZSET_OFFSET)
#  define PIC32MZ_DMACH7_SSIZINV      (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_SSIZINV_OFFSET)

#  define PIC32MZ_DMACH7_DSIZ         (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_DSIZ_OFFSET)
#  define PIC32MZ_DMACH7_DSIZCLR      (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_DSIZCLR_OFFSET)
#  define PIC32MZ_DMACH7_DSIZSET      (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_DSIZSET_OFFSET)
#  define PIC32MZ_DMACH7_DSIZINV      (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_DSIZINV_OFFSET)

#  define PIC32MZ_DMACH7_SPTR         (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_SPTR_OFFSET)
#  define PIC32MZ_DMACH7_DPTR         (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_DPTR_OFFSET)

#  define PIC32MZ_DMACH7_CSIZ         (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_CSIZ_OFFSET)
#  define PIC32MZ_DMACH7_CSIZCLR      (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_CSIZCLR_OFFSET)
#  define PIC32MZ_DMACH7_CSIZSET      (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_CSIZSET_OFFSET)
#  define PIC32MZ_DMACH7_CSIZINV      (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_CSIZINV_OFFSET)

#  define PIC32MZ_DMACH7_CPTR         (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_CPTR_OFFSET)

#  define PIC32MZ_DMACH7_DAT          (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_DAT_OFFSET)
#  define PIC32MZ_DMACH7_DATCLR       (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_DATCLR_OFFSET)
#  define PIC32MZ_DMACH7_DATSET       (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_DATSET_OFFSET)
#  define PIC32MZ_DMACH7_DATINV       (PIC32MZ_DMACH7_K1BASE+PIC32MZ_DMACH_DATINV_OFFSET)
#endif

/* Register Bit-Field Definitions ***********************************************************/
/* Global DMA Registers */
/* DMA Controller Control Register */

#define DMA_CON_DMABUSY               (1 << 11) /* Bit 15: DMA module busy */
#define DMA_CON_SUSPEND               (1 << 12) /* Bit 12: DMA suspend */
#define DMA_CON_ON                    (1 << 15) /* Bit 15: DMA on */

/* DMA Status Register */

#define DMA_STAT_DMACH_SHIFT          (0)       /* Bits 0-1: DMA channel */
#define DMA_STAT_DMACH_MASK           (3 << DMA_STAT_DMACH_SHIFT)
#define DMA_STAT_RDWR                 (1 << 3)  /* Bit 3:  Read/write status */

/* DMA Address Register -- This register contains a 32-bit address value */

/* DMA CRC Control Register */

#define DMA_CRCCON_CRCCH_SHIFT        (0)       /* Bits 0-2: CRC channel select */
#define DMA_CRCCON_CRCCH_MASK         (7 << DMA_CRCCON_CRCCH_SHIFT)
#  define DMA_CRCCON_CRCCH(n)         ((uint32_t)(n) << DMA_CRCCON_CRCCH_SHIFT)
#define DMA_CRCCON_CRCTYP             (1 << 5)  /* Bit 5:  CRC type selection */
#define DMA_CRCCON_CRCAPP             (1 << 6)  /* Bit 6:  CRC append mode */
#define DMA_CRCCON_CRCEN              (1 << 7)  /* Bit 7:  CRC enable */
#define DMA_CRCCON_PLEN_SHIFT         (8)       /* Bits 8-12: Polynomial length */
#define DMA_CRCCON_PLEN_MASK          (31 << DMA_CRCCON_PLEN_SHIFT)
#  define DMA_CRCCON_PLEN(n)          ((uint32_t)(n) << DMA_CRCCON_PLEN_SHIFT)
#define DMA_CRCCON_BITO               (1 << 24) /* Bit 24: CRC bit order selection */
#define DMA_CRCCON_WBO                (1 << 27) /* Bit 27: CRC write byte order selection */
#define DMA_CRCCON_BYTO_SHIFT         (28)      /* Bits 28-29: CRC byte order selection */
#define DMA_CRCCON_BYTO_MASK          (3 << DMA_CRCCON_BYTO_SHIFT)
#  define DMA_CRCCON_BYTO_SRCORDER    (0 << DMA_CRCCON_BYTO_SHIFT) /* No swapping (i.e., source byte order) */
#  define DMA_CRCCON_BYTO_SWAP32      (1 << DMA_CRCCON_BYTO_SHIFT) /* Endian byte swap on word boundaries */
#  define DMA_CRCCON_BYTO_SWAP32H     (2 << DMA_CRCCON_BYTO_SHIFT) /* Swap half-words on word boundaries */
#  define DMA_CRCCON_BYTO_SWAP16      (3 << DMA_CRCCON_BYTO_SHIFT) /* Endian byte swap on half-word boundaries */

/* DMA CRC Data Register -- 16 or 32-bits of data */
/* DMA CRCXOR Enable Register -- 16 or 32-bits of data */

/* Per-Channel DMA Registers */
/* DMA Channel Control Register */

